app/Services/PerformanceService.php

    public function getCachedStats(): array
    {
        return Cache::remember('app_stats', self::CACHE_DURATION, function () {
            return [
                'recipes' => Recipe::where('status', 'approved')->count(),
                'users' => User::count(),
                'categories' => Category::count(),
            ];
---
select count(*) as aggregate from `recipes` where `status` = 'approved'
select count(*) as aggregate from `users`
select count(*) as aggregate from `categories`

    public function getCachedCategories(int $limit = 6)
    {
        return Cache::remember("categories_with_recipes_{$limit}", self::CACHE_DURATION, function () use ($limit) {
            return Category::where('parent_id', null)
                ->with(['children:id,parent_id,name,slug', 'recipes:id'])
                ->withCount('recipes')
                ->limit($limit)
                ->get();
---
select `id`, `parent_id`, `name`, `slug` from `categories` where `categories`.`parent_id` in (1, 2, 3, 4, 5, 6)