app/Services/RecipeService.php

    public function getFilteredRecipes(array $filters = [], int $perPage = 12)
    {
        $query = Recipe::with(['user', 'categories', 'tags', 'images', 'favorites'])
            ->where('status', 'approved');


        // Apply filters
        $this->applyFilters($query, $filters);

        return $query->paginate($perPage);
---
select * from `favorites` where `favorites`.`recipe_id` in (1, 2, 3, 4, 5, 6)
select * from `recipes` where `status` = 'approved' order by `created_at` desc limit 12 offset 0
select * from `users` where `users`.`id` in (1, 2, 4)
select `categories`.*, `recipe_categories`.`recipe_id` as `pivot_recipe_id`, `recipe_categories`.`category_id` as `pivot_category_id` from `categories` inner join `recipe_categories` on `categories`.`id` = `recipe_categories`.`category_id` where `recipe_categories`.`recipe_id` in (1, 2, 3, 4, 5, 6)