app/Filament/Widgets/UserGrowthChart.php

select count(*) as aggregate from `users` where date(`created_at`) = '2025-07-12'
---
    protected function getData(): array
    {
        $data = [];
        $labels = [];

        for ($i = 29; $i >= 0; $i--) {
            $date = now()->subDays($i);
            $count = User::whereDate('created_at', $date)->count();