app/Livewire/WeatherSlideshowSimple.php

    public function mount()
    {
        Log::info('WeatherSlideshowSimple mounted');

        // Kiểm tra xem có thông tin vị trí từ session không
        if (session('user_location')) {
            $userLocation = session('user_location');
            $this->userLatitude = $userLocation['latitude'];
            $this->userLongitude = $userLocation['longitude'];
            $this->selectedCity = $userLocation['nearest_city_code'];
            $this->nearestCity = \App\Models\VietnamCity::where('code', $userLocation['nearest_city_code'])->first();
---
select * from `vietnam_cities` where `code` = '1' limit 1

    public function loadData()
    {
        Log::info('loadData called for city: ' . $this->selectedCity);

        // Memory optimization: Load only essential columns
        $this->recipes = Recipe::select('id', 'title', 'slug', 'description', 'summary', 'user_id', 'cooking_time', 'servings', 'difficulty')
            ->with(['user:id,name'])
            ->take(3)
            ->get();

        $this->weatherData = WeatherData::where('city_code', $this->selectedCity)->first();
---
select `id`, `name` from `users` where `users`.`id` in (2, 4)
select `id`, `title`, `slug`, `description`, `summary`, `user_id`, `cooking_time`, `servings`, `difficulty` from `recipes` limit 3
select * from `weather_data` where `city_code` = '1' limit 1

    public function findNearestCity($latitude, $longitude)
    {
        $cities = VietnamCity::all();
---
select * from `vietnam_cities`