app/Livewire/WeatherRecipeSuggestions.php

    public function mount()
    {
        // Kiểm tra xem có thông tin vị trí từ session không
        if (session('user_location')) {
            $userLocation = session('user_location');
            $this->userLatitude = $userLocation['latitude'];
            $this->userLongitude = $userLocation['longitude'];
            $this->selectedCity = $userLocation['nearest_city_code'];
            $this->nearestCity = \App\Models\VietnamCity::where('code', $userLocation['nearest_city_code'])->first();
---
select * from `vietnam_cities` where `code` = '1' limit 1

    public function loadWeatherAndSuggestions()
    {
        $this->loading = true;
        $this->error = null;

        try {
            $city = VietnamCity::where('code', $this->selectedCity)->first();
---
select * from `vietnam_cities` where `code` = '1' limit 1