app/Filament/Resources/CategoryResource.php

select `name`, `id` from `categories` where `is_active` = 1
---
                            ->maxSize(5120)
                            ->previewable(false) // Try this first
                            ->columnSpanFull(),
                        Forms\Components\Select::make('parent_id')
                            ->label('Danh mục cha')
                            ->options(fn() => \App\Models\Category::where('is_active', true)->pluck('name', 'id')->toArray())
                            ->searchable()
                            ->preload()
                            ->placeholder('Không có')
                            ->helperText('Chọn danh mục cha nếu đây là danh mục con')
                            ->disableOptionWhen(fn($value, $get) => $value == $get('id')),