app/Filament/Resources/PostResource.php

select `name`, `id` from `users`
---
    public static function form(Form $form): Form
    {
        return $form
            ->schema([
                Forms\Components\Section::make('Thông tin cơ bản')
                    ->schema([
                        Forms\Components\Select::make('user_id')
                            ->label('Tác giả')
                            ->options(User::pluck('name', 'id'))
                            ->searchable()
                            ->required(),
                        Forms\Components\TextInput::make('title')
                            ->label('Tiêu đề')
                            ->required()
                            ->maxLength(255)
                            ->live(onBlur: true)
                            ->afterStateUpdated(function (string $state, callable $set) {
                                if (!empty($state)) {
                                    $slug = Str::slug($state);
                                    // Kiểm tra xem slug đã tồn tại chưa
                                    $existingPost = \App\Models\Post::where('slug', $slug)->first();
                                    if ($existingPost) {
                                        $counter = 1;
                                        while (\App\Models\Post::where('slug', $slug . '-' . $counter)->exists()) {
                                            $counter++;
                                        }
                                        $slug = $slug . '-' . $counter;
                                    }
                                    $set('slug', $slug);