app/Models/Recipe.php

    public function isFavoritedBy(?User $user): bool
    {
        if (!$user) {
            return false;
        }
        return $this->favorites()->where('user_id', $user->id)->exists();
---
select exists(select * from `favorites` where `favorites`.`recipe_id` = 6 and `favorites`.`recipe_id` is not null and `user_id` = 1) as `exists`